print("Введите 6 координат вершин треугольника в формате `x1, y1, x2,...`:")

def vershiny():
    global x1, y1, x2, y2, x3, y3
    try:
        [x1, y1, x2, y2, x3, y3] = [s for s in (input().split(', ', maxsplit = 6))]
        a = ((x1 - x2)**2 + (y1 - y2)**2)**0.5
        b = ((x1 - x3)**2 + (y1 - y3)**2)**0.5
        c = ((x3 - x2)**2 + (y3 - y2)**2) ** 0.5
        p = (a+b+c) / 3
        S = ((p-a) * (p-b) * (p-c) * p) ** 0.25
        print("Площадь треугольника S =", S)
    except ValueError:
        print("Ошибка. Попробуйте ещё раз.")
        print("Введите 6 координат вершин треугольника в формате `x1, y1, x2,...`:")
        vershiny()
    return([x1, y1, x2, y2, x3, y3])
    
vershiny()

# a = ((x1 - x2)**2 + (y1 - y2)**2)**0.5
# b = ((x1 - x3)**2 + (y1 - y3)**2)**0.5
# c = ((x3 - x2)**2 + (y3 - y2)**2) ** 0.5
# p = (a+b+c) / 3
# S = ((p-a) * (p-b) * (p-c) * p) ** 0.25
# print("Площадь треугольника S =", S)
